/**
 *
 * model
 *
 */

const model = {
  ru: {
    fixCases: function(translation) {
      translation = translation
        .replace('один тысяч', 'одна тысяча')
        .replace('два тысяч', 'две тысячи')
        .replace('три тысяч', 'три тысячи')
        .replace('четыре тысяч', 'четыре тысячи')
      translation = translation
        .replace('один миллионов', 'один миллион')
        .replace('два миллионов', 'два миллиона')
        .replace('три миллионов', 'три миллиона')
        .replace('четыре миллионов', 'четыре миллиона')
      translation = translation
        .replace('один миллиардов', 'один миллиард')
        .replace('два миллиардов', 'два миллиарда')
        .replace('три миллиардов', 'три миллиарда')
        .replace('четыре миллиардов', 'четыре миллиарда')
      translation = translation
        .replace('один триллионов', 'один триллион')
        .replace('два триллионов', 'два триллиона')
        .replace('три триллионов', 'три триллиона')
        .replace('четыре триллионов', 'четыре триллиона')
      translation = translation
        .replace('один квадриллионов', 'один квадриллион')
        .replace('два квадриллионов', 'два квадриллиона')
        .replace('три квадриллионов', 'три квадриллиона')
        .replace('четыре квадриллионов', 'четыре квадриллиона')
      translation = translation
        .replace('один квинтиллионов', 'один квинтиллион')
        .replace('два квинтиллионов', 'два квинтиллиона')
        .replace('три квинтиллионов', 'три квинтиллиона')
        .replace('четыре квинтиллионов', 'четыре квинтиллиона')
      translation = translation
        .replace('один секстиллионов', 'один секстиллион')
        .replace('два секстиллионов', 'два секстиллиона')
        .replace('три секстиллионов', 'три секстиллиона')
        .replace('четыре секстиллионов', 'четыре секстииллиона')

      return translation
    },
  },

  uk: {
    fixCases: function(translation) {
      translation = translation
        .replace('один тисяч', 'одна тисяча')
        .replace('два тисяч', 'дві тисячі')
        .replace('три тисяч', 'три тисячі')
        .replace('чотири тисяч', 'чотири тисячі')
      translation = translation
        .replace('один мільйонів', 'один мільйон')
        .replace('два мільйонів', 'два мільйони')
        .replace('три мільйонів', 'три мільйони')
        .replace('чотири мільйонів', 'чотири мільйони')
      translation = translation
        .replace('один мільярдів', 'один мільярд')
        .replace('два мільярдів', 'два мільярди')
        .replace('три мільярдів', 'три мільярди')
        .replace('чотири мільярдів', 'чотири мільярди')
      translation = translation
        .replace('один трильйонів', 'один трильйон')
        .replace('два трильйонів', 'два трильйони')
        .replace('три трильйонів', 'три трильйони')
        .replace('чотири трильйонів', 'чотири трильйони')
      translation = translation
        .replace('один квадрильйонів', 'один квадрильйон')
        .replace('два квадрильйонів', 'два квадрильйони')
        .replace('три квадрильйонів', 'три квадрильйони')
        .replace('чотири квадрильйонів', 'чотири квадрильйони')
      translation = translation
        .replace('один квінтильйонів', 'один квінтильйон')
        .replace('два квінтильйонів', 'два квінтильйони')
        .replace('три квінтильйонів', 'три квінтильйони')
        .replace('чотири квінтильйонів', 'чотири квінтильйони')
      translation = translation
        .replace('один секстильйонів', 'один секстильйон')
        .replace('два секстильйонів', 'два сексильйони')
        .replace('три секстильйонів', 'три секстильйони')
        .replace('чотири секстильйонів', 'чотири секстильйони')

      return translation
    },
  },
}

export default model
